import pandas as pd
import numpy as np
from scipy.stats import pearsonr

data = {
    'период': [f'период{i}' for i in range(1, 13)],
    'IN1_4': [429, 182, 102, 463, 293, 5, 350, 42, 63, 35, 14, 67],
    'IN4_3': [101, 41, 461, 314, 250, 319, 376, 60, 285, 194, 6, 418],
    'IN1_1': [205, 78, 263, 494, 455, 469, 474, 77, 111, 342, 344, 168],
    'IN3_3': [89, 52, 280, 493, 178, 376, 243, 298, 377, 145, 276, 143],
    'IN1_5': [219, 429, 122, 166, 161, 67, 86, 227, 471, 58, 464, 134],
    'IN4_1': [9, 82, 277, 402, 473, 86, 393, 79, 23, 149, 230, 121],
    'IN5_3': [464, 170, 281, 167, 159, 78, 131, 132, 490, 251, 495, 302],
    'OUT3_1': [96706.1348, 31356.79, None, 235362.6, 185256.4, 5025.848, None, 12314.2, 25833.76, 14291.34, 23376.02, None],
    'OUT3_4': [871.559441, 408.6429, None, 2088.579, 1922.417, 6150.6, None, 632.2857, 2574.714, 1689.486, 1574.857, None],
    'OUT2_3': [95.6666667, 178.7909, 294, 215.9341, 3.400853, 277.6371, 33, 161.7568, 19.8538, 0.244186, 166.7024, None],
    'OUT2_2': [878199.248, 2604765, None, 95455389, 88535583, 961174.6, None, 1022772, 653394.8, 2381143, 5738701, None],
    'OUT2_1': [18463.6667, 83674.13, None, 78815.93, 1152.889, 59969.62, 916, 28145.68, 6928.977, 86.68605, 34007.29, None],
    'OUT2_4': [781, 1954, None, 1862, 1829, 950, 505, 775, 1419, 1569, 1046, None],
    'OUT1_3': [2879374, 292018.5, None, 17195902, 3.1e8, 217810.9, None, 725997.6, 15697734, 2.72e8, 1687214, None],
    'OUT4_3': [37920338, 15129.18, None, 210344.3, 229126.2, 204536.1, None, 25616.3, 15520.77, 71411.62, 413056.9, None],
    'OUT1_1': [7025682.99, 20838175, None, 7.64e8, 7.08e8, 7689773, None, 8182478, 5227536, 19049287, 45909983, None]
}

df = pd.DataFrame(data)

df_cleaned = df.dropna()

input_params = ['IN1_4', 'IN4_3', 'IN1_1', 'IN3_3', 'IN1_5', 'IN4_1', 'IN5_3']
output_params = ['OUT1_3', 'OUT4_3', 'OUT1_1']

correlation_results = {}

for out_param in output_params:
    correlation_results[out_param] = {}
    for in_param in input_params:
        corr, _ = pearsonr(df_cleaned[in_param], df_cleaned[out_param])
        correlation_results[out_param][in_param] = corr

for out_param, correlations in correlation_results.items():
    print(f"Корреляции для {out_param}:")
    for in_param, corr in correlations.items():
        print(f"  {in_param}: {corr:.2f}")
    print()

#Результат в консоли
#Корреляции для OUT1_3:
#  IN1_4: 0.03
#  IN4_3: 0.26
#  IN1_1: 0.39
#  IN3_3: -0.32
#  IN1_5: -0.47
#  IN4_1: 0.53
#  IN5_3: -0.21

#Корреляции для OUT4_3:
#  IN1_4: 0.53
#  IN4_3: -0.22
#  IN1_1: -0.17
#  IN3_3: -0.42
#  IN1_5: -0.07
#  IN4_1: -0.36
#  IN5_3: 0.44

#Корреляции для OUT1_1:
#  IN1_4: 0.65
#  IN4_3: 0.48
#  IN1_1: 0.63
#  IN3_3: 0.33
#  IN1_5: -0.29
#  IN4_1: 0.92
#  IN5_3: -0.34
